app/Services/PaymentService.php

    public function addCustomer($data){

        $customer = StripeCustomer::create([
                        "user_id" => 1,
                        "line1" => $data['line1'],
                        "postal_code" => $data['postal_code'],
                        "city" => $data['city'],
                        "state" => $data['state'],
                        "country" => $data['country']
                    ]);
---
insert into `stripe_customers` (`user_id`, `line1`, `postal_code`, `city`, `state`, `country`, `updated_at`, `created_at`) values (1, 'Et labore quae aliqu', 'Voluptatem dolores e', 'Fugiat facere qui qu', 'Nam quo do fugit qu', 'Ex doloribus eveniet', '2024-01-17 07:29:33', '2024-01-17 07:29:33')

    public function createUser($data,$serviceDetail){

        $create = [
            'name' => $data['name'],
            'email' => $data['email'],
            'mobile' => $data['mobile'],
        ];
        $randomPassword = "new" . Str::random(10) . "user";
        $create['password'] = bcrypt($randomPassword);
        $user  = User::create($create);
---
insert into `users` (`name`, `email`, `mobile`, `password`, `updated_at`, `created_at`) values ('Gisela Franklin', 'tanuja@prism-me.com', 'Esse harum occaecat', '$2y$10$0DPtQSP6n6J1d82ctFwNKO5C9vMmu2g/2hpmR5DBIpBZdLwy8vv6S', '2024-01-18 13:06:00', '2024-01-18 13:06:00')