app/Http/Controllers/InvoiceController.php

select * from `services` where `route` = 'corporate-website' limit 1
select * from `packages` where `route` = 'enterprise' limit 1
select * from `plans` where `route` = 'yearly' limit 1
---
    public function invoice($service= null , $sub = null, $package = null , $amount = null){

        $segment  = request()->segments();
        if( $segment == [] ){

            return view('invoice.home' );

        }else{

                $currentUrl = URL::current();
                $request = Request::create($currentUrl);
                $serviceDetail = $request->segments();

            if(count($segment) != 3){

                $service = Service::where('route',$serviceDetail[1] )->first();
                $package = Package::where('route',$serviceDetail[2])->first();
                $plan = Plan::where('route',$serviceDetail[3])->first();

            }else{

                $service = Service::where('route',$serviceDetail[0] )->first();
                $package = Package::where('route',$serviceDetail[1])->first();
                $plan = Plan::where('route',$serviceDetail[2])->first();