app/Http/Controllers/ServiceController.php

    public function allServices(){
            $data = Service::with('package')->get();
---
select * from `services`